{
  "DreamStory": {

    "StartRoom": {
      "Text": "You're laying in bed. Your eyes are getting heavy, and just as they shut, you're wide awake. Standing in an open field, the only thing visible is a giant hole straight ahead.",
      "Actions": {
        "Action1": ["Jump into hole","EnemyRoom1"]
      },
      "Puzzle": ["null", "ifPass", "ifFail"],
      "Enemies": [],
      "EnemyClear": "null"
    },

    "EnemyRoom1": {
      "Text": "You land in large body of water. Splashing in fear, you realize you're not the ony one. Something large grazes your leg, but the water is pitch black. Quickly you realize there's more... you've landed in shark infested waters!",
      "Actions": {
        "Action1": ["Fight the sharks.", "EnemyRoom1.5"],
        "Action2": ["Get eaten (not recommended).", "EndLose"]
      },
      "Puzzle": ["null", "ifPass", "ifFail"],
      "Enemies": [],
      "EnemyClear": "EmptyRoom2"
    },
    "EnemyRoom1.5": {
      "Text": "You land in large body of water, splashing in fear, you realize you're not the ony one. something large grazes your leg, but the water is pitch black. Quickly you realize there's more... you've landed in shark infested waters!",
      "Actions": {
        "Action1": ["Action 1 for fighting the sharks.", "ActionName"],
        "Action2": ["Action 2 for fighting the sharks.", "ActionName"]
      },
      "Puzzle": ["null", "ifPass", "ifFail"],
      "Enemies": ["Sharks"],
      "EnemyClear": "EmptyRoom2"
    },

    "EmptyRoom2": {
      "Text": "You fend your way through the sharks, but suddenly something pulls you underwater. You sink deeper into the water, afraid for your life, when you hit open air and fall to the ground. Above you lies the water you fell through, covering the entire ceiling. You realize you are trapped in a tiny room with two doors, one directly in front of you, the other to your backside.",
      "Actions": {
        "Action1": ["Walk through the door in front of you.", "PuzzleRoom1"],
        "Action2": ["Walk through the door behind you", "EnemyRoom2"],
        "Action3": ["Dry off and wait in this room.", "EmptyRoom2-2"]
      },
      "Puzzle": ["null", "ifPass", "ifFail"],
      "Enemies": [],
      "EnemyClear": "null"
    },

    "EmptyRoom2-2": {
      "Text": "As you take a break to dry off, you feel a sudden breeze but don't know where its coming from. As you look up, you're staring into the funnel of a tornado. Quickly being taken off your feet spinning, with no end in sight.",
      "Actions": {
        "Action1": ["Give up.", "EndLose"]
      },
      "Puzzle": ["null", "ifPass", "ifFail"],
      "Enemies": [],
      "EnemyClear": "null"
    },

    "EnemyRoom2": {
      "Text": "After going through the door, you fall through a hole. You land safely in forest, the trees softening the blow. You here rustling from two directions, and before you know it a bear and a wolf surround you.",
      "Actions": {
        "Action1": ["Fight the bear first.", "EnemyRoom2.1"],
        "Action2": ["Fight the wolf first.", "EnemyRoom2.2"]
      },
      "Puzzle": ["null", "ifPass", "ifFail"],
      "Enemies": [],
      "EnemyClear": "PuzzleRoom2"
    },

    "EnemyRoom2.1": {
      "Text": "After going through the door, you fall through a hole. You land safely in forest, the trees softening the blow. You here rustling from two directions, and before you know it a bear and a wolf surround you.",
      "Actions": {
        "Action1": ["Fight the bear first.", "AttackAction"],
        "Action2": ["Fight the wolf first.", "AttackAction"]
      },
      "Puzzle": ["null", "ifPass", "ifFail"],
      "Enemies": ["Bear", "Wolf"],
      "EnemyClear": "PuzzleRoom2"
    },

    "EnemyRoom2.2": {
      "Text": "After going through the door, you fall through a hole. You land safely in a forest, the trees softening the blow. You here rustling from two directions, and before you know it a bear and a wolf surround you.",
      "Actions": {
        "Action1": ["Fight the bear first.", "AttackAction"],
        "Action2": ["Fight the wolf first.", "AttackAction"]
      },
      "Puzzle": ["null", "ifPass", "ifFail"],
      "Enemies": ["Wolf", "Bear"],
      "EnemyClear": "PuzzleRoom2"
    },

    "PuzzleRoom1": {
      "Text": "The new room looks harmless, but no way out. At least you're safe, for now...\n\nIn front of you sits some sort of puzzle. It looks important.\n\nWARNING: ignoring a puzzle room makes you take 5 damage. Only risk if you think it's necessary!",
      "Actions": {
        "Action1": ["Attempt the puzzle.", "DoPuzzle"],
        "Action2": ["Ignore the puzzle.", "IgnorePuzzle"]
      },
      "Puzzle": ["rps", "EmptyRoom3", "EndLose"],
      "Enemies": [],
      "EnemyClear": "null"
    },

    "EmptyRoom3": {
      "Text": "You sucessfully complete the puzzle. When you complete it however, the floor collapses. You land safely in a forest, the trees softening the blow. you start to feel the ground shake. The trees start to converge closer together, creating walls around you. As you feel the wall behind you touch you back, you realize that the newly formed room is getting smaller. With no way out, you realize the puzzle is the only chance of survival.",
      "Actions": {
        "Action1": ["Attempt the puzzle.", "DoPuzzle"],
        "Action2": ["Ignore the puzzle.", "IgnorePuzzle"]
      },
      "Puzzle": ["scrambler", "LastRoom", "EndLose"],
      "Enemies": [],
      "EnemyClear": "null"
    },

    "PuzzleRoom2": {
      "Text": "After killing the animals around you, you start to feel the ground shake. The trees start to converge closer together, creating walls around you. As you feel the wall behind you touch you back, you realize that the newly formed room is getting smaller. With no way out, you realize the puzzle is the only chance of survival.",
      "Actions": {
        "Action1": ["Attempt the puzzle.", "DoPuzzle"],
        "Action2": ["Ignore the puzzle.", "IgnorePuzzle"]
      },
      "Puzzle": ["scrambler", "LastRoom", "EndLose"],
      "Enemies": [],
      "EnemyClear": "null"
    },

    "LastRoom": {
      "Text": "Just before the walls reach the width of your shoulders, you complete the puzzle. They begin to retract and a glowing door appears in front of you.",
      "Actions": {
        "Action1": ["Go through the glowing door.","EndWin"]
      },
      "Puzzle": ["null", "ifPass", "ifFail"],
      "Enemies": [],
      "EnemyClear": "null"
    },

    "EndLose": {
      "Text": "You wake up in your bed from your strange dream. Since you lost, you feel no sense of satisfaction from the ordeal. Failure."
    },

    "EndWin": {
      "Text": "After going through the glowing door, white light blinds you. You wake up in your bed, a long line of drool on your face. While it may have not been a real experience, you still feel the strange satisfaction of completing your journey. Success!"
    }

  }
}